Autodesk.Revit.DB.ConnectionValidationWarning.#ctor(Autodesk.Revit.DB.ConnectionResolution,Autodesk.Revit.DB.ConnectionWarning,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Constructor.
resolution:
Resolution type.
reason:
Warning reason.
part1:
First element Id.
part2:
Second element Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016